#!/bin/bash
if [ "$#" -ne 3 ]; then
    echo "Ошибка: Нужно передать ровно 3 аргумента!"
    exit 1
fi

p1="$1"
op="$2"
p2="$3"

if [[ ! "$p1" =~ ^[а-яА-Яa-zA-Z]$ ]]; then
    echo "Переменная 1: Засчитано"
else
    echo "Недопустимый символ в переменной 1"
    exit 1
fi

# 4. Проверяем и определяем операцию
if [[ "$op" = "-" ]]; then
    echo "Вычитаем"
elif [[ "$op" = "+" ]]; then
    echo "Складываем"
elif [[ "$op" = "/" ]]; then
    echo "Делим"
elif [[ "$op" = "*" ]]; then
    echo "Умножаем"
else
    echo "Символ операции отсутствует или не неверен"
    exit 1
fi


if [[ ! "$p2" =~ ^[а-яА-Яa-zA-Z]$ ]]; then
    echo "Идет вычисление..."
else
    echo "Недопустимый символ в переменной 2"
    exit 1
fi
r=$((p1 "$op" p2))
echo "Результат: $r"

exit 0
